/**
 * 
 * Vue中组件通信
 * 1. props(父子通信/子父通信)
 * 2. 自定义事件和原生事件(父子通信/子父通信),组件上的事件是自定义(系统自带的事件/自己自定义)的还是原生的(.native)
 * 3. 事件总线(任意组件通信)
 * 4. PubSub(消息订阅与发布)(任意组件通信)
 * 5. Vuex(任意组件通信):您的项目为什么用(不用)vuex
 * 6. 插槽(普通插槽没有name/具名插槽(命名插槽)有name/作用域插槽slot-scope(v-slot))(父子通信/子父通信)
 * 7. v-model指令(父子通信/子父通信)
 * 8. .sync修饰符(父子通信/子父通信)
 * 9. $attrs和$listeners(父子通信/子父通信)
 * 10. $children和$parent(父子通信/子父通信)
 * 11. provide/inject(任意组件通信)
 * 
 * 组件的关系
 * 
 * 组件的数据的传递就是组件通信
 * 方式有哪些
 * 哪些是任意组件通信的方式
 * 哪些是父子组件通信的方式
 * 有什么优缺点
 * 我的项目中用的是什么方式
 * 扩展
 * react中的通信方式...
 * 
 * 某个通信方式的原理
 * 原型
 * ....
 * 响应式数据-----劫持
 * 
 * 
 * 
 * 
 * 
 */